#   Тут і надалі під текою МОТЛОХ розуміється тека, що вказана користувачем в якості аргументу при запуску програми.
#   Програма створює поряд із текою МОТЛОХ теку SORTED, куди поміщає всі файли, знайдені в МОТЛОХ, та її вкладеннях.
#   При переміщенні назви всіх файлів транслітеруються. Пробіли, а також спецсімволи заміняються на "_". Розширення залишаються без змін.
#   В теці SORTED всі файли знаходяться у відповідних теках згідно розширення, а саме:
#           zip, gz, targ                           розпаковані у відповідні теки архіви, будуть знаходитись у теці ARCHIVES
#           mp3, ogg, wav, amr                      будуть знаходитись у теці AUDIO
#           doc, docx, txt, pdf, xls, xlsx, pptx    будуть знаходитись у теці DOCUMENTS
#           jpeg, png, jpg, svg                     будуть знаходитись у теці IMAGES
#           avi, mp4, mov, mkv                      будуть знаходитись у теці VIDEO
#           всі інші розширення                     будуть знаходитись у теці OTHERS
#   В процесі роботи програми генерується файл звіту ZVIT.TXT в якому наглядно відображено які файли де знаходяться, та їх попереднє 
#   місторозташування. Також під кожною групою файлів відображається їх кількість. А загальна кількість опрацьованих файлів є в кінці звіту.
#   Якщо при виконанні програма знайде попередню папку SORTED, користувачу буде повідомлено про це, а також запитано, чи потрібно продовжувати 
#   виконання програми, чи ні. Якщо користувач погоджується продовжувати, тека SORTED видаляється, та створюється знов з подальшим сортуванням.
#   Якщо користувач відмовляється від продовження роботи, програма завершує своє виконання, не вносячи ніякіх змін.
#   По закінченю роботи програми користувачу буде запропоновано видалити інформацію в попередньому вигляді, або зберегти її на 14 днів.
#   Якщо користувач погоджується на збереження інформації, тека МОТЛОХ переіменовується в теку ВИДАЛИТИ-ПІСЛЯ- та вказується дата, після якої
#   можна сміливо видаляти теку.  


from console import inputy, make_dirs, last_chance, write_file
from sorting import sorting


# PATH = 'c:\Pastore\Py\Temp\Мотлох' # Строка аргументу, використовувалась при розробці.
sort_path = ''
root_path = ''
dic_arch = {}
dic_aud = {}
dic_doc = {}
dic_imag = {}
dic_oth = {}
dic_vid = {}
list_res = ['', '', '', '', '', '']
list_dic = [dic_arch, dic_aud, dic_doc, dic_imag, dic_oth, dic_vid]



PATH = inputy()
sort_path, root_path = make_dirs(PATH)
sorting(PATH, sort_path, list_dic, list_res)
write_file(sort_path + '/ZVIT.TXT', list_dic, list_res)
last_chance(PATH, root_path)
